Feature: Коментиране на торент

  Scenario: Коментиране на торент при нелогнат потребител
    Given Потребителят отваря страницата на торент(Коментиране на торент)
    When Потребителя не е влязъл в профила си(Коментиране на торент)
    Then Вижда съобщение(Коментиране на торент) "Влезте в профила си или се регистрирайте"
 
  Scenario Outline: Коментиране на торент
    Given Потребителят отваря страницата на торент(Коментиране на торент)
    When Потребителя е влязъл в профила си(Коментиране на торент)
    And Въвежда текст "<text>" в полето за създаване на коментар
    And Натиска върху бутон публикувай
    Then Вижда съобщение(Коментиране на торент) "<message>"

    Examples: 
      | text  | message |
      | Коментар  | Коментарът е публикуван успешно |
      || Въведете текст |
