Feature: Теглене на торент

  Scenario: Теглене на торент при нелогнат потребител
    Given Потребителят отваря страницата на торент(Теглене на торент)
    When Потребителят не е влязъл в профила си(Теглене на торент)
    Then Вижда съобщение(Теглене на торент) "Влезте в профила си или се регистрирайте"
    
  Scenario: Теглене на торент
    Given Потребителят отваря страницата на торент(Теглене на торент)
    And Торентa има 0 брой изтегляния
    When Потребителят е влязъл в профила си(Теглене на торент)
    And Кликне върху бутона за теглене
    Then Вижда съобщение(Теглене на торент) "Изтеглянето е успешно"
    And Торента вече има 1 брой изтегляния