Feature: Преглед на лоюбими торенти

  Scenario: Преглед на любими торенти при нелогнат потребител
    Given Потребителя отваря екран за преглед на любими торенти
    When Потребителя не е влязъл в профила си(Преглед на любими торенти)
    Then Вижда съобщение(Преглед на любими торенти) "Влезте в профила си или се регистрирайте"
    
  Scenario Outline: Преглед на любими торенти
    Given Потребителя отваря екран за преглед на любими торенти
    When Потребителят "<username>" е влязъл в профила си(Преглед на любими торентит)
    Then Вижда списък с торенти - "<torrentList>"
	
	Examples:
	|username|torrentList|
	|name|Sample|
	|name2|Sample1, Sample2|
	|name3|Sample1, Sample2, Sample3|
	
	Scenario: Преглед на любими торенти при липса на такива
    Given Потребителя отваря екран за преглед на любими торенти
    When Потребителят "empty" е влязъл в профила си(Преглед на любими торентит)
    Then Вижда съобщение(Преглед на любими торенти) "Добавете торенти към любими"