Feature: Качване на торент

	Scenario: Качване на торент при нелогнат потребител
    Given Потребителят отваря страницата за качване на торент
    When Потребителят не е влязъл в профила си
    Then Вижда съобщение "Влезте в профила си или се регистрирайте"

	Scenario: Качване на торент с валидни данни, но само с 3 жанра
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Erannorth Reborn: Underworld"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "RPG", "Стратегия", "Приключенски"
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Торентът е качен успешно"

  Scenario: Качване на торент с валидни данни, но само с 2 жанра
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Nioh 2"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "PC ISO"
    And Въвежда жанрове "RPG", "Екшън", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Торентът е качен успешно"
    
  Scenario: Качване на торент с валидни данни, но само с 1 жанр
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "RPG", "", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Торентът е качен успешно"
    
  Scenario: Качване на торент с валидни данни, при първи празен жанр
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "", "RPG", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Торентът е качен успешно"
    
  Scenario: Качване на торент без заглавие
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие ""
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "RPG", "", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Въведете заглавие"   
    
  Scenario: Качване на торент без описание
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание ""
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "RPG", "", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Въведете описание"
    
  Scenario: Качване на торент без избиране на Каталог
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание "Sample"
    And Въвежда каталог ""
    And Въвежда тип "Linux"
    And Въвежда жанрове "RPG", "", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Изберете валиден каталог"
    
  Scenario: Качване на торент без избиране на Тип
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип ""
    And Въвежда жанрове "RPG", "", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Изберете валиден тип"
    
  Scenario: Качване на торент без избиране на Жанрове
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "", "", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Изберете поне един валиден жанр"
    
  Scenario: Качване на торент с повтаряне на Жанрове
    Given Потребителят отваря страницата за качване на торент
    When Потребителят е влязъл в профила си
    And Въвежда заглавие "Gordian Quest"
    And Въвежда описание "Sample"
    And Въвежда каталог "Игри"
    And Въвежда тип "Linux"
    And Въвежда жанрове "RPG", "RPG", ""
    And Кликва върху бутона за качване на торент
    Then Вижда съобщение "Не повтаряйте жанрове"   
